---
title: ConversionFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ConversionFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ConversionFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotConvertPercentToDouble { get; }` | `ConversionFailures.CannotConvertPercentToDouble` | FailureDefinitionId |
| `FailureDefinitionId CannotConvertTempToDouble { get; }` | `ConversionFailures.CannotConvertTempToDouble` | FailureDefinitionId |
| `FailureDefinitionId CannotConvertToDouble { get; }` | `ConversionFailures.CannotConvertToDouble` | FailureDefinitionId |
| `FailureDefinitionId UndefinedFluidUnit { get; }` | `ConversionFailures.UndefinedFluidUnit` | FailureDefinitionId |
| `FailureDefinitionId UndefinedTemperatureUnit { get; }` | `ConversionFailures.UndefinedTemperatureUnit` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```